      *****************************************************************
      * Nom du programme:    INTR0001                               
      * Auteur original: MANUEL JARRY                                
      *
      * Journal d'entretien                                             
      * Date       Auteur        Exigence de maintenance               
      * ---------- ------------  --------------------------------------- 
      * 29/10/2025 MANUEL JARRY  Créé pour classe COBOL       
      *                                                               
      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.  INTR0001.
       AUTHOR. MANUEL JARRY. 
       INSTALLATION. COBOL DEVELOPMENT CENTER. 
       DATE-WRITTEN. 29/10/2025. 
       DATE-COMPILED. JJ/MM/AA. 
       SECURITY. NON-CONFIDENTIAL.
      *****************************************************************
      *
       ENVIRONMENT DIVISION.
      *
       INPUT-OUTPUT SECTION. 
      *
       DATA DIVISION. 
      *
       FILE SECTION. 
      *
       WORKING-STORAGE SECTION. 
      *
       77  FIN-DE-SECTION-SWITCH      PIC 9       VALUE 0.
       77  VALEUR-ACTUELLE            PIC 9(7)V99.
       

